problems="""1$問題 を綿密に検討 しない で $実行に 移す こ とが 多い $
2$どち らか とい うと怠惰な 方で す$
3$他 の 人 と比べ る と話 し好 きで す$
4$どち らか とい うと地味で めだ た ない 方です$
5$思い や りが ある方 で す$
6$親 しい 仲 間で も$ 本 当に信用す る こ とはで きませ ん $
7$将来の こ とを見通 す こ と が で き る 方 で す $
8$ど うで も い い こ とを$ 気 に病 む 傾向が あ ります$
9$疲れ やす くは あ りませ ん $
10$軽率 に物事 を決 めた り$行動 して しまい ます $
11$ど ち らか とい うと$に ぎや か な性格 で す$
12$仕 事 や勉強 には精 力 的 に取 り組 み ます$
13$自分 で 悩 む必 要 の ない こ と まで 心 配 し て しま うの は 確 か です$
14$人 前で 話すの は苦手で す$
15$誰にで も親切 にす るよ うに心 がけて い ま す$
16$あま り心 配症 で は あ りませ ん $
17$他の 人 と同様 に$神経 質で は な い と信 じて い ます$
18$どち らか とい うと$ 気持 ちが動揺 しやすい $
19$積極 的に 人 と付き 合 う方 で す $
20$特 に人 前 を気 にす る方 で は あ りませ ん $
21$どち らか とい うと徹底的に やる方で す$
22$難 しい 問題 にぶ つ か る と$頭 が混 乱 する こ とが 多い $
23$どち らか とい うと引っ 込 み 思案 で す$
24$他の 人 と比 べ る と$あれ これ 悩ん だ り$思い わず らっ た りする方 で す$
25$み ん なで 決め た こ とは $で きるだ け協力 しよ うと思 い ます $
26$物 事 を難 し く考え が ちで す$
27$どち らか とい うと$飽 きっ ぽい 方 で す $
28$物 事 が うま くい か な い と$す ぐに投げ出 した くな ります$
29$い っ も何か 気が か りで す$
30$い ろい ろな 分野の 言葉をた くさん知 っ て い ます$
31$人か ら親切 に され る と$何か 下 心 が あ りそ うで 警戒 し がちです$
32$問題 を分 析 する の は 苦手 な方 で す$
33$自分 には それ をす るカが ない と思 っ て $あき らめ て しまった こ とが何回か あ ります$
34$機会 さえあれば$大 い に世 の 中に役 立つ こ とがで き るの にと思い ます$
35$どち らか とい うと$お とな しい 性格 で す $
36$何 かに取 り組 ん で も$ 中途半端 で やめ て しま うこ とが多い $
37$あま り 自分の 意 見 を主 張 し ない 方で す $
38$他 の 人 と同 じよ うに $す ぐに友達 がで き る方 で す$
39$私 は た しか に 自信に 欠けて い ま す$
40$い ろい ろな問題 や事柄か ら共 通 した性 質を見 つ けだす の は他 の 人 よ り得意で す$
41$機会 さえ 与えられれば皆の よい リーダーになれ る と思 います$
42$私 は重 要人物で す$
43$ほ とん どの 知 人 か ら好 か れ て い ます $
44$い つ も気が か りな こ とが あ っ て $落 ちつ きませ ん$
45$みん なで 決め た こ とで も$自分 に不 利に なる場合 は協力 した くあ りませ ん$
46$ひ ろ く物事 を知 っ て い る方で す$
47$い つ も と違 っ た や り方 を$な か なか 思 い っ き ませ ん $
48$どち らか とい うと人 情が あつ い 方 で す$
49$誠実 に仕事 を して も$あま り得に はな りませ ん $
50$自信 に満 ち あふ れ て い ます $
51$筋道 を立 て て 物事を考 える方です$
52$す ぐに $ま ごま ご します $
53$他 の 人 と比 べ る と活発 に行動す る方で す$
54$大抵の 人 が 動揺する よ うな時 で も$ 落ちつ い て 対処す ることが で きます$
55$はっ きりと し た 目標 を持 っ て $ 適切なや り方 で 取 り組み ます$
56$くよくよ考 え込 み ます$
57$元気 がよい と人 に言 わ れ ます$
58$学校で は クラス の人達 の前で話すの がひ どく苦手で した (です)$
59$他 の 人 よ り洗練 され た 考え方 をす る方で す$
60$どち らか とい うと無 口 で す $
61$他 の 人 と比 べ る と$物事の 本質が 見抜 ける方で す $
62$こ ま ご まと し た こ とま で 気 にな っ て しまい ます$
63$人 の 言葉には 裏が あ るの で $その まま信 じない 方がよい と思 い ます$
64$どち らか とい うと三 日坊 主 で $根気 がな い 方で す$
65$い つ も人の 立場に なっ て考 え るよ うに心 が けて い ます$
66$緊張 して イ ライ ラす る こ とが よ くあ ります $
67$旅行な どで は あらか じ め細か く計画 を立 て る こ とが 多い $
68$入 助 けの た めな らや っ か い な こ とで もや ります $
69$初対面の 人 と話 をす る の は 骨が折れ る もの です $
70$子 供や老人 の 世 話 をす るの が 好 きで す $"""

calc_memo="""Correct Attitudes
True ： 9 20 41 43 50
False ： 33 39 52 58 69
Extraversion ’1
、rue 3 11 19 38 53 57
False 4 14 23 35 37 60
Agreeableness
Tn ユe 5 15 25 48 65 68 70
False 6 31 45 49 63
Conscientiousness
True ： 12 21 51 55 67
False ： 1 2 10 27 28 36 64
EmotienalStability（Neuroticism）
True ： 正6 17
False ： 8 13 18 24 26 29 44 56 62 66
Intellect （Openness ）
True ； 7 30 34 40 42 46 54 59 61
Fa正se ： 22 32 47
"""

List = problems.split("\n");
import re
print("const problems = [",end='')
for index, row in enumerate(List):
    r = row[0:-1]
    r = re.sub(' ','',r)
    R = r.split('$')
    r = R[0] + ': ' + R[1]
    for i in range(len(R)):
        if(i>=2): r += R[i]
    r += '。'
    # print('"' + r+ '", ', end='')
    print(r)
print('];')


TIPIJ ="""1: 活発で、外向的だと思う
2: 他人に不満をもち、もめごとを起こしやすいと思う
3: しっかりしていて、自分に厳しいと思う
4: 心配性で、うろたえやすいと思う
5: 新しいことが好きで、変わった考えをもつと思う
6: ひかえめで、おとなしいと思う
7: 人に気をつかう、やさしい人間だと思う
8: だらしなく、うっかりしていると思う
9: 冷静で、気分が安定していると思う
10: 発想力に欠けた、平凡な人間だと思う"""

["全く違うと思う", "おおよそ違うと思う", "少し違うと思う", "どちらでもない", "少しそう思う", "まあまあそう思う", "強くそう思う"];

L=TIPIJ.split("\n")
print("const problems = [",end='')
for r in L:
    print('"' + r+ '。", ', end='')
    # print(r)
print('];')